# SetRenderingQualitySettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingSettings..::..SetRenderingQualitySettings Method
RenderingSettings Class See Also
---
Change rendering quality settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetRenderingQualitySettings(
	RenderingQualitySettings settings
)
```

Visual Basic
---
```text
Public Sub SetRenderingQualitySettings ( _
	settings As RenderingQualitySettings _
)
```

Visual C++
---
```text
public:
void SetRenderingQualitySettings(
	RenderingQualitySettings^ settings
)
```

# ### Parameters
settings
    Type: Autodesk.Revit.DB..::..RenderingQualitySettings An instance of the new rendering quality settings.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RenderingSettings Class
Autodesk.Revit.DB Namespace